/** @jsx jsx */
import { jsx, Box } from 'theme-ui';
import Template from './Template';

const milestone = {
	name: 'First Quarter - Be A Designer',
	sprint: '10',
	duration: '3 month',
	summery:
		'প্রথম কোয়ার্টারে আমাদের টার্গেট থাকবে ওয়েব ডিজাইনের বিষয়বস্তু গুলো ভালো ভাবে মাথার মধ্যে ঢুকিয়ে দেওয়া। পরবর্তী কোয়ার্টার গুলোতেও আমাদের ওয়েব ডিজাইন নিয়ে কাজ করতেই হবে। কিন্তু আমাদের প্রথম মাইলস্টোন থাকবে ওয়েব ডিজাইনের ভিত্তি স্থাপন করা। প্রতিটা কোয়ার্টারকেই আমরা ছয় ভাগে ভাগ করবো। মানে প্রতিটা মাইলস্টোনে আমাদের কাছে থাকবে ছয়টা স্প্রিন্ট। একটা স্প্রিন্টে আমরা সময় পাবো পনের দিন করে। প্রতিদিন আমাদের টার্গেট থাকবে নূন্যতম চার ঘণ্টা করে শেখার পিছনে সময় ব্যয় করা।',
	sprints: [
		{
			count: 1,
			name: 'Play with HTML & CSS',
			duration: '15 Days',
			contents: {
				text:
					'প্রথম স্প্রিন্টে আমাদের টার্গেট খুবই সীমিত। আমরা এই সময়ে শিখবো - ',
				keyPoints: [
					'কিভাবে কোড এডিটর ইন্সটল করতে হয়',
					'কোড এডিটরের কিছু প্রো ফিচারস',
					'কিভাবে এইচটিএমএল ফাইল ক্রিয়েট করতে হয়',
					'এইচটিএমএল কি এবং কিভাবে কাজ করে',
					'এইচটিএমএল এর কমন ট্যাগ এবং অ্যাট্রিবিউটস কি কি আছে',
					'সিএসএস কি এবং কিভাবে এইচটিএমএল এর সাথে কাজ করে',
					'সিএসএস এর সিলেক্টরস',
					'সিএসএস এর কমন প্রোপার্টিস',
					'সিএসএস টেক্সট এবং ফন্টস',
					'সিএসএস ইউনিটস',
					'সিএসএস ফ্লোটস',
					'সিএসএস বক্স মডেল',
					'একটা কার্ড ডিজাইন প্রোজেক্ট',
					'ন্যাভিগেশন বার ডিজাইন প্রোজেক্ট',
					'লিস্ট ডিজাইন প্রোজেক্ট',
					'সাইন আপ ফর্ম ডিজাইন প্রোজেক্ট',
					'প্রোফাইল কার্ড ডিজাইন প্রোজেক্ট',
				],
			},
		},
		{
			count: 2,
			name: 'Create Beautiful Web Pages',
			duration: '15 Days',
			contents: {
				text:
					'প্রথম স্প্রিন্ট ভালো ভাবে সম্পন্ন করার পর এইচটিএমএল সিএসএস সম্পর্কে আমাদের একটা ভালো ধারণা হয়ে যাবে। এখন আমরা চাইলেই এডভান্সড ওয়েব সাইট ডিজাইন করতে পারবো। তবে তার পূর্বে আমাদের লে আউট ডিজাইনটা শিখে নিতে হবে। এই স্প্রিন্ট শেষে আমরা সুন্দর সুন্দর ওয়েব পেজ ডিজাইন করতে শিখে যাবো। এই স্প্রিন্টে আমাদের Sprint Backlog (স্প্রিন্টের টাস্ক) হচ্ছে - ',
				keyPoints: [
					'সিএসএস লে আউট সিস্টেম',
					'ফ্লেক্সবক্স',
					'গ্রিড লে আউট',
					'ডিসপ্লে প্রোপার্টিস',
					'সিএসএস পসিশন',
					'সুডো ক্লাস এবং এলিমেন্ট',
					'গুগল ক্রোম ডেভেলপার টুলস',
					'ড্রপ ডাউন মেনু প্রজেক্ট',
					'মেগা মেনু প্রজেক্ট',
					'ইমেজ গ্যালারি প্রজেক্ট',
					'Masonry স্টাইলের ইমেজ গ্যালারি প্রজেক্ট',
					'কমপ্লেক্স ফর্ম ডিজাইন প্রজেক্ট',
				],
			},
		},
		{
			count: 3,
			name: 'Project Week 1',
			duration: '7 Days',
			contents: {
				text:
					'Project Week 1 স্প্রিন্টের সময় সাত দিন। এই সাত দিনে আমরা একটা সুন্দর ১ পেজের পোর্টফলিও ওয়েব সাইট ডিজাইন করে ফেলবো। ওয়েবসাইটের মধ্যে ৫-৬ টা ভিন্ন ভিন্ন সেকশন থাকবে। স্কিল সেকশন থাকবে, পোর্টফলিও সেকশন থাকবে, এবাউট সেকশন থাকবে, কন্ট্যাক্ট ফর্ম থাকবে। প্রোজেক্ট শেষ করে সেটা লাইভও করতে হবে। তাই এই স্প্রিন্টেই আমরা গিট, গিটহাব এবং গিটহাব পেজ সম্পর্কে কিছু জ্ঞান অর্জন করে ফেলবো। প্রোজেক্ট যদি সময়ের আগেই শেষ হয়ে যায় তাহলে হয় একটা বড় সড় ঘুম দিব না হয় একটা ইন্সপিরেশনাল মুভি দেখবো। আমার বিশ্বাস সবাই ৩-৪ দিনের মধ্যেই প্রোজেক্ট শেষ করে ফেলবেন।',
				keyPoints: [],
			},
		},
		{
			count: 4,
			name: 'Project Week 2',
			duration: '7 Days',
			contents: {
				text:
					'Project Week 1 শেষ করে একটা লম্বা ঘুমতো সবাই দিয়েছেন।  কারণ মাঝখানে একদিনের একটা বড় ছুটি ছিল। এবার ঘুম থেকে দ্রুত উঠে পরুন Project Week 2 স্প্রিন্ট শুরু। এই সপ্তাহে আমরা একটু বড় সড় প্রোজেক্ট করবো। প্রথম প্রোজেক্টে আপনি একটা পোর্টফলিও সাইট ডিজাইন করেছিলেন। এবার একটা পার্সোনাল ব্লগ ডিজাইন করে ফেলবেন। ব্লগের একটা সুন্দর হোম পেজ থাকবে, একটা আর্কাইভ পেজ থাকবে, আর্টিকেল পড়ার জন্য একটা পেজ থাকবে, প্রতিটা আর্টিকেল এর নিচে কমেন্টের জন্য ডেডিকেটেড সেকশন থাকবে, একটা সার্চ পেজ থাকবে। এই ফিচার গুলো থাকলেই এখন হয়ে যাবে, এর থেকে বেশি দরকার নেই। ',
				keyPoints: [],
			},
		},
	],
	congratulation:
		'আপনি আপনার প্রথম মাইলস্টোন সফল ভাবে শেষ করতে পেরেছেন। এখন আপনি চাইলে  আপনার শেখার যাত্রা এখানেই শেষ করে দিয়ে মার্কেটেপ্লেসের জন্য প্রস্তুতি নিতে পারেন, ওয়েব ডিজাইনার হিসেবে জবের প্রিপারেশন নিতে পারেন, একটু কষ্ট করে ওয়ার্ড প্রেস থিম ডেভেলপমেন্ট শিখে নিতে পারেন অথবা থিম ফরেস্টে নিজের তৈরি টেম্পলেট বিক্রির ব্যবসাও শুরু করতে পারেন। সম্বাবনা এন্ডলেস, কিন্তু আমার সাজেশন হচ্ছে এখনই থেমে যাওয়ার কোনো দরকার নেই।  ওয়েবের যাত্রা তো কেবল শুরু হয়েছে, আর এই যাত্রায় আপনি একটা মাত্র মাইলস্টোন কমপ্লিট করেছেন। যদি ফ্যামিলিগত কোনো সমস্যা না থাকে তাহলে কোনো ভাবেই এখন উপার্জনের চিন্তা করবেন না। উপার্জনের চিন্তা না করে জ্ঞান অর্জনের চিন্তা করবেন। ',
};

const Main = () => {
	return (
		<Box>
			<Template milestone={milestone} direction='ltr' />
			<Template milestone={milestone} direction='rtl' />
		</Box>
	);
};

export default Main;
