{
    "name": "Web Boost",
    "version": "v0.1.0",
    "author": "HM Nayem",
    "site": {
        "meta": {
            "title": "Web Boost",
            "subtitle": "A Beginner-Friendly Fullstack Web Development Course Using Agile",
            "description": "An Agile way to learn web development. This document will provide all the necessary guidelines need a beginner to be a fullstack web developer. Fullstack Development journey begins with Web Boost",
            "keywords": ["web development", "programming", "html", "css", "javascript", "web design", "jquery", "bootstrap", "frontend development", "backend development", "fullstack development", "react", "nodejs"] 
        },
        "assets": {
            "logo": "logo",
            "favicon": "icon",
            "mode": {
                "dark": "dark-mode-icon",
                "white": "white-mode-icon"
            },
            "duration": {
                "dark": "duration-icon-dark",
                "white": "duration-icon-white"
            },
            "sprint": {
                "dark": "sprint-icon-dark",
                "white": "sprint-icon-white"
            }
        }
    },
    "milestoneSummary": {
        "title": "Learn with Agile Methodology",
        "summery": "এই ওয়েবসাইটটি তৈরি করা হয়েছে সমস্ত বিগিনার প্রোগ্রামারদের জন্য যারা সঠিক গাইডলাইনের অভাবে বছরের পর বছর চেষ্টা করেও ভালো একজন ওয়েব ডেভেলপার হতে পারছেন না। Agile এবং Scrum মেনে আপনাদের জন্য তৈরি করা হয়েছে পুরো এক বছরের কারিকুলাম। যেখানে রয়েছে চারটা মাইলস্টোন এবং ত্রিশটা স্প্রিন্ট। এখন হয়তো টার্মস গুলো বুঝতে একটু কষ্ট হচ্ছে। পুরো ডকুমেন্ট পড়া শেষে আপনি সব কিছু নিজেই বুঝে যাবেন।",
        "milestones": {
            "one": {
            "name": "First Milestone",
            "body": "একজন ওয়েব ডিজাইনার হয়ে ওঠা"
            },
            "two": {
                "name": "Second Milestone",
                "body": "জাভাস্ক্রিপ্ট প্রোগ্রামিং ল্যাংগুয়েজটি আয়ত্ত করা"
            },
            "three": {
                "name": "Third Milestone",
                "body": "ডাইনামিক ওয়েবসাইট এবং এপিআই তৈরি করতে শেখা"
            },
            "four": {
                "name": "Fourth Milestone",
                "body": "ফ্রন্টেন্ড ব্যাকেন্ড সহ কমপ্লিট অ্যাপলিকেশন তৈরি করা"
            }
        }
    },
    "bullets": [
        {
            "title": "Fixed Target",
            "body": "আমরা আপনাদের জন্য এক বছরের গোল সেট করে দিয়েছি এবং আপনাদের এক বছরের জন্য টার্গেট ফিক্সড"
        },
        {
            "title": "Small Goal",
            "body": "ছোট ছোট স্প্রিন্টের মাধ্যমে আমরা বড় গোলটাকে অনেক গুলো ছোট ছোট গোলে ভেঙ্গে ফেলেছি যেন সহজে অর্জন করা যায়"
        },
        {
            "title": "Short Journey",
            "body": "ছোট গোল হওয়ার কারণে জার্নিটাও অনেক ছোট হবে। রাস্তায় হোঁচট খাওয়ার সম্ভাবনা ও অনেক কম থাকবে।"
        },
        {
            "title": "Zero Distraction",
            "body": "ছোট জার্নি ছোট রাস্তা। রাস্তা যদি ছোট হয় তাহলে এদিকে ওদিকে ডিস্ট্রাক্ট হয়ে যাওয়ার ও কোনো চান্স থাকবে না"
        },
        {
            "title": "Monitor Progress", 
            "body": "যেহেতু অনেক গুলো ছোট ছোট গোল রয়েছে, তাই আপনি সহজেই নিজের প্রোগ্রেস ট্রাক করতে পারবেন অনেক সহজে"
        },
        {
            "title": "Big Achievement",
            "body": "সব ছোট গোল যখন পূরণ হয়ে যাবে তখন দেখা যাবে এচিভমেন্টটা অনেক বড় হয়ে গেছে"
        }
    ],
    "milestones": [
        {
            "name": "First Quarter - Be A Designer",
            "sprint": "10",
            "duration": "3 month",
            "summery": "প্রথম কোয়ার্টারে আমাদের টার্গেট থাকবে ওয়েব ডিজাইনের বিষয়বস্তু গুলো ভালো ভাবে মাথার মধ্যে ঢুকিয়ে দেওয়া। পরবর্তী কোয়ার্টার গুলোতেও আমাদের ওয়েব ডিজাইন নিয়ে কাজ করতেই হবে। কিন্তু আমাদের প্রথম মাইলস্টোন থাকবে ওয়েব ডিজাইনের ভিত্তি স্থাপন করা। প্রতিটা কোয়ার্টারকেই আমরা ছয় ভাগে ভাগ করবো। মানে প্রতিটা মাইলস্টোনে আমাদের কাছে থাকবে ছয়টা স্প্রিন্ট। একটা স্প্রিন্টে আমরা সময় পাবো পনের দিন করে। প্রতিদিন আমাদের টার্গেট থাকবে নূন্যতম চার ঘণ্টা করে শেখার পিছনে সময় ব্যয় করা।",
            "sprints": [
                {
                    "count": 1,
                    "name": "Play with HTML & CSS",
                    "duration": "15 Days",
                    "contents": {
                        "text": "প্রথম স্প্রিন্টে আমাদের টার্গেট খুবই সীমিত। আমরা এই সময়ে শিখবো - ",
                        "keyPoints": [
                            "কিভাবে কোড এডিটর ইন্সটল করতে হয়",
                            "কোড এডিটরের কিছু প্রো ফিচারস",
                            "কিভাবে এইচটিএমএল ফাইল ক্রিয়েট করতে হয়",
                            "এইচটিএমএল কি এবং কিভাবে কাজ করে",
                            "এইচটিএমএল এর কমন ট্যাগ এবং অ্যাট্রিবিউটস কি কি আছে",
                            "সিএসএস কি এবং কিভাবে এইচটিএমএল এর সাথে কাজ করে",
                            "সিএসএস এর সিলেক্টরস",
                            "সিএসএস এর কমন প্রোপার্টিস",
                            "সিএসএস টেক্সট এবং ফন্টস",
                            "সিএসএস ইউনিটস",
                            "সিএসএস ফ্লোটস",
                            "সিএসএস বক্স মডেল",
                            "একটা কার্ড ডিজাইন প্রোজেক্ট",
                            "ন্যাভিগেশন বার ডিজাইন প্রোজেক্ট",
                            "লিস্ট ডিজাইন প্রোজেক্ট",
                            "সাইন আপ ফর্ম ডিজাইন প্রোজেক্ট",
                            "প্রোফাইল কার্ড ডিজাইন প্রোজেক্ট"  
                        ]
                    }
                },
                {
                    "count": 2,
                    "name": "Create Beautiful Web Pages",
                    "duration": "15 Days",
                    "contents": {
                        "text": "প্রথম স্প্রিন্ট ভালো ভাবে সম্পন্ন করার পর এইচটিএমএল সিএসএস সম্পর্কে আমাদের একটা ভালো ধারণা হয়ে যাবে। এখন আমরা চাইলেই এডভান্সড ওয়েব সাইট ডিজাইন করতে পারবো। তবে তার পূর্বে আমাদের লে আউট ডিজাইনটা শিখে নিতে হবে। এই স্প্রিন্ট শেষে আমরা সুন্দর সুন্দর ওয়েব পেজ ডিজাইন করতে শিখে যাবো। এই স্প্রিন্টে আমাদের Sprint Backlog (স্প্রিন্টের টাস্ক) হচ্ছে - ",
                        "keyPoints": [
                            "সিএসএস লে আউট সিস্টেম",
                            "ফ্লেক্সবক্স",
                            "গ্রিড লে আউট",
                            "ডিসপ্লে প্রোপার্টিস",
                            "সিএসএস পসিশন",
                            "সুডো ক্লাস এবং এলিমেন্ট",
                            "গুগল ক্রোম ডেভেলপার টুলস",
                            "ড্রপ ডাউন মেনু প্রজেক্ট",
                            "মেগা মেনু প্রজেক্ট",
                            "ইমেজ গ্যালারি প্রজেক্ট",
                            "Masonry স্টাইলের ইমেজ গ্যালারি প্রজেক্ট",
                            "কমপ্লেক্স ফর্ম ডিজাইন প্রজেক্ট"
                        ]
                    }
                },
                {
                    "count": 3,
                    "name": "Project Week 1",
                    "duration": "7 Days",
                    "contents": {
                        "text": "Project Week 1 স্প্রিন্টের সময় সাত দিন। এই সাত দিনে আমরা একটা সুন্দর ১ পেজের পোর্টফলিও ওয়েব সাইট ডিজাইন করে ফেলবো। ওয়েবসাইটের মধ্যে ৫-৬ টা ভিন্ন ভিন্ন সেকশন থাকবে। স্কিল সেকশন থাকবে, পোর্টফলিও সেকশন থাকবে, এবাউট সেকশন থাকবে, কন্ট্যাক্ট ফর্ম থাকবে। প্রোজেক্ট শেষ করে সেটা লাইভও করতে হবে। তাই এই স্প্রিন্টেই আমরা গিট, গিটহাব এবং গিটহাব পেজ সম্পর্কে কিছু জ্ঞান অর্জন করে ফেলবো। প্রোজেক্ট যদি সময়ের আগেই শেষ হয়ে যায় তাহলে হয় একটা বড় সড় ঘুম দিব না হয় একটা ইন্সপিরেশনাল মুভি দেখবো। আমার বিশ্বাস সবাই ৩-৪ দিনের মধ্যেই প্রোজেক্ট শেষ করে ফেলবেন।",
                        "keyPoints": []
                    }
                },
                {
                    "count": 4,
                    "name": "Project Week 2",
                    "duration": "7 Days",
                    "contents": {
                        "text": "Project Week 1 শেষ করে একটা লম্বা ঘুমতো সবাই দিয়েছেন।  কারণ মাঝখানে একদিনের একটা বড় ছুটি ছিল। এবার ঘুম থেকে দ্রুত উঠে পরুন Project Week 2 স্প্রিন্ট শুরু। এই সপ্তাহে আমরা একটু বড় সড় প্রোজেক্ট করবো। প্রথম প্রোজেক্টে আপনি একটা পোর্টফলিও সাইট ডিজাইন করেছিলেন। এবার একটা পার্সোনাল ব্লগ ডিজাইন করে ফেলবেন। ব্লগের একটা সুন্দর হোম পেজ থাকবে, একটা আর্কাইভ পেজ থাকবে, আর্টিকেল পড়ার জন্য একটা পেজ থাকবে, প্রতিটা আর্টিকেল এর নিচে কমেন্টের জন্য ডেডিকেটেড সেকশন থাকবে, একটা সার্চ পেজ থাকবে। এই ফিচার গুলো থাকলেই এখন হয়ে যাবে, এর থেকে বেশি দরকার নেই।",
                        "keyPoints": []
                    }
                },
                {
                    "count": 5,
                    "name": "Responsive Web Design",
                    "duration": "15 Days",
                    "contents": {
                        "text": "দুইটা প্রোজেক্ট শেষ করার পরে দেখবেন আপনার তৈরি করা ডিজাইন আপনার কম্পিউটারে খুব সুন্দর দেখা যাচ্ছে কিন্তু অন্য কোনো কম্পিউটারে একদম ভাল দেখা যাচ্ছে না। ডিজাইন পুরো ভেঙ্গে চুড়ে একাকার হয়ে গেছে। কারণ আপনার ওয়েবসাইট রেস্পন্সিভ না। এই স্প্রিন্টে আপনি শিখবেন কিভাবে বুটস্ট্র্যাপ ব্যবহার করে রেস্পন্সিভ ডিজাইন করতে হয়। বুটস্ট্র্যাপ ভালো ভাবে শিখতে সাত দিনের বেশি সময় লাগবে না। বাকি সাত দিনে আপনার আগের করা ডিজাইন গুলো বুটস্ট্রাপ ব্যবহার করে রেস্পন্সিভ করে ফেলবেন। যে যত তাড়াতাড়ি শেষ করতে পারবেন সে তত বেশি ছুটি কাটাতে পারবেন। এই স্প্রিন্টে অবশ্য আপনার অনেক কাজ আছে, এই স্প্রিন্টে শিখবেন - ",
                        "keyPoints": [
                            "রেস্পন্সিভ ডিজাইন কি",
                            "মিডিয়া কুয়েরি কিভাবে ব্যবহার করে",
                            "বুটস্ট্যাপ কি, কিভাবে ব্যবহার করতে হয়",
                            "বুটস্ট্যাপের রেস্পন্সিভ গ্রিড লে আউট সিস্টেম",
                            "বিউল্টইন কম্পোনেন্ট এবং ইউটিলিটি"
                        ]
                    }
                },
                {
                    "count": 6,
                    "name": "CSS Programming",
                    "duration": "7 Days",
                    "contents": {
                        "text": "বুটস্ট্যাপ ব্যবহার করে আপনার ডিজাইন করা ব্লগ সাইটটা ডিজাইন করতে গিয়ে দেখবেন অনেক অনেক সমস্যার সম্মুখীন হচ্ছেন। অনেক জায়গায় কাস্টমাইজেশনের দরকার হচ্ছে। অনেক সিএসএস কোড লিখতে হচ্ছে। বুটস্ট্র্যাপের অরিজিনাল সিএসএস পরিবর্তন করতে হচ্ছে। কিন্তু বুটস্ট্র্যাপ ডিজাইন করা হয়েছে Sass ব্যবহার করে। আর Sass না জানার কারণে আপনি ঠিক ভাবে কিছু করতেও পারছেন না। এই সাত দিনের স্প্রিন্টে আপনাকে Sass এর মুখ্য বিষয় গুলো শিখে ফেলতে হবে। যেমন - ",
                        "keyPoints": [
                            "Sass কি",
                            "Sass এবং সিএসএস কিভাবে একসাথে কাজ করে",
                            "কিভাবে Sass কম্পাইল করতে হয়",
                            "ভ্যারিয়েবল",
                            "নেস্টিং",
                            "পার্টিয়ালস",
                            "অপারেটরস"
                        ]
                    }
                },
                {
                    "count": 7,
                    "name": "Start Creating Dynamic Content",
                    "duration": "7 Days",
                    "contents": {
                        "text": "বুটস্ট্যাপ এবং Sass শেখার পরেই আপনি মোটামোটি যে কোনো ওয়েবসাইট ডিজাইন করার জন্য পার্ফেক্ট হয়ে যাবেন। এর সাথে সাথে যদি অল্প কিছু ইন্টারেক্টিভিটি যুক্ত করা যায় তাহলে মার্কেটে আপনার একটা ভালো ডিমান্ড তৈরি হয়ে যাবে। এই সময় আপনার প্রথম পরিচয় হবে প্রোগ্রামিং এর সাথে। কিন্তু ভয় পাওয়ার কোনো কারণ নেই। কারণ এখানে প্রোগ্রামিং এর খুব অল্প কিছুই আপনি শিখবেন। আপনার টার্গেট হচ্ছে কিভাবে জেকুয়েরি প্লাগিন ব্যবহার করে ওয়েবসাইটে ইন্টারেক্টিভিটি যুক্ত করা করবেন। এই স্প্রিন্ট শেষ করে আপনার দুই দিনের ছুটি। এই সময়ে কোডিং ব্যতীত সব কিছুই করতে পারবেন। কিন্তু ভুল করেও কোডিং করা যাবে না। পরবর্তী সাত দিনের স্প্রিন্টে আপনি শিখবেন - ",
                        "keyPoints": [
                            "জাভাস্ক্রিপ্ট আর জেকুয়েরি এর পার্থক্য",
                            "ভ্যারিয়েবল, অপারেটর এবং এক্সপ্রেশন",
                            "বেসিক অ্যারে এবং অবজেক্ট",
                            "ফাংশন বেসিক কনসেপ্ট",
                            "কিভাবে জেকুয়েরি ইন্সটল করবেন",
                            "জেকুয়েরি সিলেক্টরস",
                            "জেকুয়েরি ইভেন্টস বেসিক",
                            "জেকুয়েরি কমন প্লাগিন্স"
                        ]
                    }
                },
                {
                    "count": 8,
                    "name": "Project Week 3",
                    "duration": "2 Days",
                    "contents": {
                        "text": "দুই দিনের ছুটি শেষ করে এবার দুই দিনের ছোট্ট একটা স্প্রিন্ট শেষ করতে হবে। Bootstrap, Sass এবং JQuery ব্যবহার করে ছোট্ট একটা কোম্পানির জন্য একটা ওয়েবসাইট ডিজাইন করে দিতে হবে। অনেকেই এক ঘণ্টার মধ্যেই শেষ করে ফেলবেন আমি জানি। ওয়েবসাইটে যা যা থাকেব",
                        "keyPoints": [
                            "একটা সিম্পল হোম পেজ",
                            "একটা এবাউট পেজ",
                            "একটা কন্ট্যাক্ট পেজ"
                        ]
                    }
                },
                {
                    "count": 9,
                    "name": "Project Week 4",
                    "duration": "5 Days",
                    "contents": {
                        "text": "এবারের স্প্রিন্ট পাঁচ দিনের। এই পাঁচ দিনের জন্য আপনার প্রোজেক্ট হচ্ছে একজন ফটোগ্রাফারের জন্য একটা ওয়েবসাইট ডিজাইন করতে হবে। নিচের ফিচার গুলো দিয়ে একটা ওয়েবসাইট ডিজাইন করে দিতে হবে। কেউ যদি তিন দিনের মধ্যে শেষ করতে পারেন তাহলে দুই দিন ছুটি।",
                        "keyPoints": [
                            "ফটোগ্রাফারের একটা পোর্টফলিও থাকবে",
                            "ইমেজ গ্যালারি থাকবে",
                            "এপ্রাইসিং টেবিল থাকবে",
                            "হোম পেজে তার ফিচার করা কিছু ইমেজ ক্যারোসেল থাকবে",
                            "ইমেজ ভিউয়ার থাকবে",
                            "তার সাথে কন্ট্যাক্ট করার একটা পেজ থাকবে"
                        ]
                    }
                },
                {
                    "count": 9,
                    "name": "Project Week 4",
                    "duration": "5 Days",
                    "contents": {
                        "text": "এবারের স্প্রিন্ট পাঁচ দিনের। এই পাঁচ দিনের জন্য আপনার প্রোজেক্ট হচ্ছে একজন ফটোগ্রাফারের জন্য একটা ওয়েবসাইট ডিজাইন করতে হবে। নিচের ফিচার গুলো দিয়ে একটা ওয়েবসাইট ডিজাইন করে দিতে হবে। কেউ যদি তিন দিনের মধ্যে শেষ করতে পারেন তাহলে দুই দিন ছুটি।",
                        "keyPoints": [
                            "ফটোগ্রাফারের একটা পোর্টফলিও থাকবে",
                            "ইমেজ গ্যালারি থাকবে",
                            "এপ্রাইসিং টেবিল থাকবে",
                            "হোম পেজে তার ফিচার করা কিছু ইমেজ ক্যারোসেল থাকবে",
                            "ইমেজ ভিউয়ার থাকবে",
                            "তার সাথে কন্ট্যাক্ট করার একটা পেজ থাকবে"
                        ]
                    }
                }
                
            ]
        }
    ]
}