{
    "name": "Web Boost",
    "version": "v0.1.0",
    "author": "HM Nayem",
    "site": {
        "meta": {
            "title": "Web Boost",
            "subtitle": "A Beginner-Friendly Fullstack Web Development Course Using Agile",
            "description": "An Agile way to learn web development. This document will provide all the necessary guidelines need a beginner to be a fullstack web developer. Fullstack Development journey begins with Web Boost",
            "keywords": ["web development", "programming", "html", "css", "javascript", "web design", "jquery", "bootstrap", "frontend development", "backend development", "fullstack development", "react", "nodejs"] 
        },
        "assets": {
            "logo": "logo",
            "favicon": "icon",
            "mode": {
                "dark": "dark-mode-icon",
                "white": "white-mode-icon"
            },
            "duration": {
                "dark": "duration-icon-dark",
                "white": "duration-icon-white"
            },
            "sprint": {
                "dark": "sprint-icon-dark",
                "white": "sprint-icon-white"
            }
        }
    },
    "milestoneSummary": {
        "title": "Learn with Agile Methodology",
        "summary": "এই ওয়েবসাইটটি তৈরি করা হয়েছে সমস্ত বিগিনার প্রোগ্রামারদের জন্য যারা সঠিক গাইডলাইনের অভাবে বছরের পর বছর চেষ্টা করেও ভালো একজন ওয়েব ডেভেলপার হতে পারছেন না। Agile এবং Scrum মেনে আপনাদের জন্য তৈরি করা হয়েছে পুরো এক বছরের কারিকুলাম। যেখানে রয়েছে চারটা মাইলস্টোন এবং ত্রিশটা স্প্রিন্ট। এখন হয়তো টার্মস গুলো বুঝতে একটু কষ্ট হচ্ছে। পুরো ডকুমেন্ট পড়া শেষে আপনি সব কিছু নিজেই বুঝে যাবেন।",
        "milestones": {
            "one": {
                "name": "First Milestone",
                "body": "মডার্ন ওয়েবসাইট ডিজাইন করার জন্য নিজেকে একজন দক্ষ ওয়েব ডিজাইনার হিসেবে গড়ে তোলা",
                "color": "milestone1",
                "count": 1
            },
            "two": {
                "name": "Second Milestone",
                "body": "ডাইনামিক ওয়েবসাইট ডিজাইনের জন্য জাভাস্ক্রিপ্ট প্রোগ্রামিং ল্যাংগুয়েজটি আয়ত্ত করা",
                "color": "milestone2",
                "count": 2
            },
            "three": {
                "name": "Third Milestone",
                "body": "নোডজেস এবং এক্সপ্রেসের মাধ্যমে ডাইনামিক ওয়েবসাইট এবং এপিআই তৈরি করতে শেখা",
                "color": "milestone3",
                "count": 3
            },
            "four": {
                "name": "Fourth Milestone",
                "body": "ফ্রন্টেন্ডে রিয়্যাক্ট শেখার মাধ্যমে ফ্রন্টেন্ড ব্যাকেন্ড সহ ফুলস্ট্যাক ওয়েব অ্যাপলিকেশন তৈরি করা",
                "color": "milestone4",
                "count": 4
            }
        }
    },
    "bullets": [
        {
            "title": "Fixed Target",
            "body": "আমরা আপনাদের জন্য এক বছরের গোল সেট করে দিয়েছি এবং আপনাদের এক বছরের জন্য টার্গেট ফিক্সড"
        },
        {
            "title": "Small Goal",
            "body": "ছোট ছোট স্প্রিন্টের মাধ্যমে আমরা বড় গোলটাকে অনেক গুলো ছোট ছোট গোলে ভেঙ্গে ফেলেছি যেন সহজে অর্জন করা যায়"
        },
        {
            "title": "Short Journey",
            "body": "ছোট গোল হওয়ার কারণে জার্নিটাও অনেক ছোট হবে। রাস্তায় হোঁচট খাওয়ার সম্ভাবনাও অনেক কম থাকবে।"
        },
        {
            "title": "Zero Distraction",
            "body": "ছোট জার্নি ছোট রাস্তা। রাস্তা যদি ছোট হয় তাহলে এদিকে ওদিকে ডিস্ট্রাক্ট হয়ে যাওয়ারও কোনো চান্স থাকবে না"
        },
        {
            "title": "Monitor Progress", 
            "body": "যেহেতু অনেক গুলো ছোট ছোট গোল রয়েছে, তাই আপনি সহজেই নিজের প্রোগ্রেস ট্রাক করতে পারবেন"
        },
        {
            "title": "Big Achievement",
            "body": "সব ছোট গোল যখন পূরণ হয়ে যাবে তখন দেখা যাবে এচিভমেন্টটা অনেক বড় হয়ে গেছে"
        }
    ],
    "milestones": [
        {
            "name": "First Quarter - Be A Designer",
            "sprint": "10",
            "duration": "3 months",
            "summary": "প্রথম কোয়ার্টারে আমাদের টার্গেট থাকবে ওয়েব ডিজাইনের বিষয়বস্তু গুলো ভালো ভাবে মাথার মধ্যে ঢুকিয়ে দেওয়া। পরবর্তী কোয়ার্টার গুলোতেও আমাদের ওয়েব ডিজাইন নিয়ে কাজ করতেই হবে। কিন্তু আমাদের প্রথম মাইলস্টোন থাকবে ওয়েব ডিজাইনের ভিত্তি স্থাপন করা। প্রতিটা কোয়ার্টারকেই আমরা ছয় ভাগে ভাগ করবো। মানে প্রতিটা মাইলস্টোনে আমাদের কাছে থাকবে ছয়টা স্প্রিন্ট। একটা স্প্রিন্টে আমরা সময় পাবো পনের দিন করে। প্রতিদিন আমাদের টার্গেট থাকবে নূন্যতম চার ঘণ্টা করে শেখার পিছনে সময় ব্যয় করা।",
            "sprints": [
                {
                    "count": 1,
                    "name": "Play with HTML & CSS",
                    "duration": "15 Days",
                    "contents": {
                        "text": "প্রথম স্প্রিন্টে আমাদের টার্গেট খুবই সীমিত। আমরা এই সময়ে শিখবো - ",
                        "keyPoints": [
                            "কিভাবে কোড এডিটর ইন্সটল করতে হয়",
                            "কোড এডিটরের কিছু প্রো ফিচারস",
                            "কিভাবে এইচটিএমএল ফাইল ক্রিয়েট করতে হয়",
                            "এইচটিএমএল কি এবং কিভাবে কাজ করে",
                            "এইচটিএমএল এর কমন ট্যাগ এবং অ্যাট্রিবিউটস কি কি আছে",
                            "সিএসএস কি এবং কিভাবে এইচটিএমএল এর সাথে কাজ করে",
                            "সিএসএস এর সিলেক্টরস",
                            "সিএসএস এর কমন প্রোপার্টিস",
                            "সিএসএস টেক্সট এবং ফন্টস",
                            "সিএসএস ইউনিটস",
                            "সিএসএস ফ্লোটস",
                            "সিএসএস বক্স মডেল",
                            "একটা কার্ড ডিজাইন প্রোজেক্ট",
                            "ন্যাভিগেশন বার ডিজাইন প্রোজেক্ট",
                            "লিস্ট ডিজাইন প্রোজেক্ট",
                            "সাইন আপ ফর্ম ডিজাইন প্রোজেক্ট",
                            "প্রোফাইল কার্ড ডিজাইন প্রোজেক্ট"  
                        ]
                    }
                },
                {
                    "count": 2,
                    "name": "Create Beautiful Web Pages",
                    "duration": "15 Days",
                    "contents": {
                        "text": "প্রথম স্প্রিন্ট ভালো ভাবে সম্পন্ন করার পর এইচটিএমএল সিএসএস সম্পর্কে আমাদের একটা ভালো ধারণা হয়ে যাবে। এখন আমরা চাইলেই এডভান্সড ওয়েব সাইট ডিজাইন করতে পারবো। তবে তার পূর্বে আমাদের লে আউট ডিজাইনটা শিখে নিতে হবে। এই স্প্রিন্ট শেষে আমরা সুন্দর সুন্দর ওয়েব পেজ ডিজাইন করতে শিখে যাবো। এই স্প্রিন্টে আমাদের Sprint Backlog (স্প্রিন্টের টাস্ক) হচ্ছে - ",
                        "keyPoints": [
                            "সিএসএস লে আউট সিস্টেম",
                            "ফ্লেক্সবক্স",
                            "গ্রিড লে আউট",
                            "ডিসপ্লে প্রোপার্টিস",
                            "সিএসএস পসিশন",
                            "সুডো ক্লাস এবং এলিমেন্ট",
                            "গুগল ক্রোম ডেভেলপার টুলস",
                            "ড্রপ ডাউন মেনু প্রজেক্ট",
                            "মেগা মেনু প্রজেক্ট",
                            "ইমেজ গ্যালারি প্রজেক্ট",
                            "Masonry স্টাইলের ইমেজ গ্যালারি প্রজেক্ট",
                            "কমপ্লেক্স ফর্ম ডিজাইন প্রজেক্ট"
                        ]
                    }
                },
                {
                    "count": 3,
                    "name": "Project Week 1",
                    "duration": "7 Days",
                    "contents": {
                        "text": "Project Week 1 স্প্রিন্টের সময় সাত দিন। এই সাত দিনে আমরা একটা সুন্দর ১ পেজের পোর্টফলিও ওয়েব সাইট ডিজাইন করে ফেলবো। ওয়েবসাইটের মধ্যে ৫-৬ টা ভিন্ন ভিন্ন সেকশন থাকবে। স্কিল সেকশন থাকবে, পোর্টফলিও সেকশন থাকবে, এবাউট সেকশন থাকবে, কন্ট্যাক্ট ফর্ম থাকবে। প্রোজেক্ট শেষ করে সেটা লাইভও করতে হবে। তাই এই স্প্রিন্টেই আমরা গিট, গিটহাব এবং গিটহাব পেজ সম্পর্কে কিছু জ্ঞান অর্জন করে ফেলবো। প্রোজেক্ট যদি সময়ের আগেই শেষ হয়ে যায় তাহলে হয় একটা বড় সড় ঘুম দিব না হয় একটা ইন্সপিরেশনাল মুভি দেখবো। আমার বিশ্বাস সবাই ৩-৪ দিনের মধ্যেই প্রোজেক্ট শেষ করে ফেলবেন।",
                        "keyPoints": []
                    }
                },
                {
                    "count": 4,
                    "name": "Project Week 2",
                    "duration": "7 Days",
                    "contents": {
                        "text": "Project Week 1 শেষ করে একটা লম্বা ঘুমতো সবাই দিয়েছেন।  কারণ মাঝখানে একদিনের একটা বড় ছুটি ছিল। এবার ঘুম থেকে দ্রুত উঠে পরুন Project Week 2 স্প্রিন্ট শুরু। এই সপ্তাহে আমরা একটু বড় সড় প্রোজেক্ট করবো। প্রথম প্রোজেক্টে আপনি একটা পোর্টফলিও সাইট ডিজাইন করেছিলেন। এবার একটা পার্সোনাল ব্লগ ডিজাইন করে ফেলবেন। ব্লগের একটা সুন্দর হোম পেজ থাকবে, একটা আর্কাইভ পেজ থাকবে, আর্টিকেল পড়ার জন্য একটা পেজ থাকবে, প্রতিটা আর্টিকেল এর নিচে কমেন্টের জন্য ডেডিকেটেড সেকশন থাকবে, একটা সার্চ পেজ থাকবে। এই ফিচার গুলো থাকলেই এখন হয়ে যাবে, এর থেকে বেশি দরকার নেই।",
                        "keyPoints": []
                    }
                },
                {
                    "count": 5,
                    "name": "Responsive Web Design",
                    "duration": "15 Days",
                    "contents": {
                        "text": "দুইটা প্রোজেক্ট শেষ করার পরে দেখবেন আপনার তৈরি করা ডিজাইন আপনার কম্পিউটারে খুব সুন্দর দেখা যাচ্ছে কিন্তু অন্য কোনো কম্পিউটারে একদম ভাল দেখা যাচ্ছে না। ডিজাইন পুরো ভেঙ্গে চুড়ে একাকার হয়ে গেছে। কারণ আপনার ওয়েবসাইট রেস্পন্সিভ না। এই স্প্রিন্টে আপনি শিখবেন কিভাবে বুটস্ট্র্যাপ ব্যবহার করে রেস্পন্সিভ ডিজাইন করতে হয়। বুটস্ট্র্যাপ ভালো ভাবে শিখতে সাত দিনের বেশি সময় লাগবে না। বাকি সাত দিনে আপনার আগের করা ডিজাইন গুলো বুটস্ট্রাপ ব্যবহার করে রেস্পন্সিভ করে ফেলবেন। যে যত তাড়াতাড়ি শেষ করতে পারবেন সে তত বেশি ছুটি কাটাতে পারবেন। এই স্প্রিন্টে অবশ্য আপনার অনেক কাজ আছে, এই স্প্রিন্টে শিখবেন - ",
                        "keyPoints": [
                            "রেস্পন্সিভ ডিজাইন কি",
                            "মিডিয়া কুয়েরি কিভাবে ব্যবহার করে",
                            "বুটস্ট্র্যাপ কি, কিভাবে ব্যবহার করতে হয়",
                            "বুটস্ট্র্যাপের রেস্পন্সিভ গ্রিড লে আউট সিস্টেম",
                            "বিল্টইন কম্পোনেন্ট এবং ইউটিলিটি"
                        ]
                    }
                },
                {
                    "count": 6,
                    "name": "CSS Programming",
                    "duration": "7 Days",
                    "contents": {
                        "text": "বুটস্ট্র্যাপ ব্যবহার করে আপনার ডিজাইন করা ব্লগ সাইটটা ডিজাইন করতে গিয়ে দেখবেন অনেক অনেক সমস্যার সম্মুখীন হচ্ছেন। অনেক জায়গায় কাস্টমাইজেশনের দরকার হচ্ছে। অনেক সিএসএস কোড লিখতে হচ্ছে। বুটস্ট্র্যাপের অরিজিনাল সিএসএস পরিবর্তন করতে হচ্ছে। কিন্তু বুটস্ট্র্যাপ ডিজাইন করা হয়েছে Sass ব্যবহার করে। আর Sass না জানার কারণে আপনি ঠিক ভাবে কিছু করতেও পারছেন না। এই সাত দিনের স্প্রিন্টে আপনাকে Sass এর মুখ্য বিষয় গুলো শিখে ফেলতে হবে। যেমন - ",
                        "keyPoints": [
                            "Sass কি",
                            "Sass এবং সিএসএস কিভাবে একসাথে কাজ করে",
                            "কিভাবে Sass কম্পাইল করতে হয়",
                            "ভ্যারিয়েবল",
                            "নেস্টিং",
                            "পার্টিয়ালস",
                            "অপারেটরস"
                        ]
                    }
                },
                {
                    "count": 7,
                    "name": "Start Creating Dynamic Content",
                    "duration": "7 Days",
                    "contents": {
                        "text": "বুটস্ট্র্যাপ এবং Sass শেখার পরেই আপনি মোটামোটি যে কোনো ওয়েবসাইট ডিজাইন করার জন্য পার্ফেক্ট হয়ে যাবেন। এর সাথে সাথে যদি অল্প কিছু ইন্টারেক্টিভিটি যুক্ত করা যায় তাহলে মার্কেটে আপনার একটা ভালো ডিমান্ড তৈরি হয়ে যাবে। এই সময় আপনার প্রথম পরিচয় হবে প্রোগ্রামিং এর সাথে। কিন্তু ভয় পাওয়ার কোনো কারণ নেই। কারণ এখানে প্রোগ্রামিং এর খুব অল্প কিছুই আপনি শিখবেন। আপনার টার্গেট হচ্ছে কিভাবে জেকুয়েরি প্লাগিন ব্যবহার করে ওয়েবসাইটে ইন্টারেক্টিভিটি যুক্ত করবেন। এই স্প্রিন্ট শেষ করে আপনার দুই দিনের ছুটি। এই সময়ে কোডিং ব্যতীত সব কিছুই করতে পারবেন। কিন্তু ভুল করেও কোডিং করা যাবে না। পরবর্তী সাত দিনের স্প্রিন্টে আপনি শিখবেন - ",
                        "keyPoints": [
                            "জাভাস্ক্রিপ্ট আর জেকুয়েরি এর পার্থক্য",
                            "ভ্যারিয়েবল, অপারেটর এবং এক্সপ্রেশন",
                            "বেসিক অ্যারে এবং অবজেক্ট",
                            "ফাংশন বেসিক কনসেপ্ট",
                            "কিভাবে জেকুয়েরি ইন্সটল করবেন",
                            "জেকুয়েরি সিলেক্টরস",
                            "জেকুয়েরি ইভেন্টস বেসিক",
                            "জেকুয়েরি কমন প্লাগিন্স"
                        ]
                    }
                },
                {
                    "count": 8,
                    "name": "Project Week 3",
                    "duration": "2 Days",
                    "contents": {
                        "text": "দুই দিনের ছুটি শেষ করে এবার দুই দিনের ছোট্ট একটা স্প্রিন্ট শেষ করতে হবে। Bootstrap, Sass এবং JQuery ব্যবহার করে ছোট্ট একটা কোম্পানির জন্য একটা ওয়েবসাইট ডিজাইন করে দিতে হবে। অনেকেই এক ঘণ্টার মধ্যেই শেষ করে ফেলবেন আমি জানি। ওয়েবসাইটে যা যা থাকেব",
                        "keyPoints": [
                            "একটা সিম্পল হোম পেজ",
                            "একটা এবাউট পেজ",
                            "একটা কন্ট্যাক্ট পেজ"
                        ]
                    }
                },
                {
                    "count": 9,
                    "name": "Project Week 4",
                    "duration": "5 Days",
                    "contents": {
                        "text": "এবারের স্প্রিন্ট পাঁচ দিনের। এই পাঁচ দিনের জন্য আপনার প্রোজেক্ট হচ্ছে একজন ফটোগ্রাফারের জন্য একটা ওয়েবসাইট ডিজাইন করতে হবে। নিচের ফিচার গুলো দিয়ে একটা ওয়েবসাইট ডিজাইন করে দিতে হবে। কেউ যদি তিন দিনের মধ্যে শেষ করতে পারেন তাহলে দুই দিন ছুটি।",
                        "keyPoints": [
                            "ফটোগ্রাফারের একটা পোর্টফলিও থাকবে",
                            "ইমেজ গ্যালারি থাকবে",
                            "এপ্রাইসিং টেবিল থাকবে",
                            "হোম পেজে তার ফিচার করা কিছু ইমেজ ক্যারোসেল থাকবে",
                            "ইমেজ ভিউয়ার থাকবে",
                            "তার সাথে কন্ট্যাক্ট করার একটা পেজ থাকবে"
                        ]
                    }
                },
                {
                    "count": 10,
                    "name": "Project Week 5",
                    "duration": "8 Days",
                    "contents": {
                        "text": "এটাই এই কোয়ার্টারের সর্বশেষ প্রোজেক্ট এবং সর্বশেষ স্প্রিন্ট। এই প্রোজেক্টটাতো একটু ভালো হতে হবে তাই না? এইবার আপনি একটা ইকমার্সের জন্য ওয়েবসাইট ডিজাইন করবেন। অনেকেই ভাববেন, এই প্রোজেক্টটি আপনি আট দিনে কিভাবে করবেন? আপনি ভাবছেন কারণ আপনি আপনার বর্তমান অবস্থা দিয়ে চিন্তা করছেন। ওপরের নয়টা স্প্রিন্ট শেষ করার পরে এই প্রোজেক্ট শেষ করতে বেশিরভাগ মানুষের পাঁচ দিন সময় লাগবে। পাঁচ দিনে প্রোজেক্ট শেষ করে তিন দিনের একটা ট্যুরও দিয়ে আসবে অনেকেই।",
                        "keyPoints": [
                            "প্রোডাক্ট দিয়ে সাজানো হোম পেজ",
                            "ক্যাটাগরি পেজ",
                            "মেগা মেনু",
                            "সার্চ পেজ",
                            "প্রোডাক্ট পেজ",
                            "শপিং কার্ট পেজ",
                            "চেক আউট পেজ",
                            "লগিন পেজ",
                            "রেজিস্ট্রেশন পেজ",
                            "ইউজার ড্যাশবোর্ড পেজ"
                        ]
                    }
                }
            
            ],
            "congratulation": "আপনি আপনার প্রথম মাইলস্টোন সফলভাবে শেষ করতে পেরেছেন। এখন আপনি চাইলে  আপনার শেখার যাত্রা এখানেই শেষ করে দিয়ে মার্কেটেপ্লেসের জন্য প্রস্তুতি নিতে পারেন, ওয়েব ডিজাইনার হিসেবে জবের প্রিপারেশন নিতে পারেন, একটু কষ্ট করে ওয়ার্ড প্রেস থিম ডেভেলপমেন্ট শিখে নিতে পারেন অথবা থিম ফরেস্টে নিজের তৈরি টেম্পলেট বিক্রির ব্যবসাও শুরু করতে পারেন। সম্বাবনা এন্ডলেস, কিন্তু আমার সাজেশন হচ্ছে এখনই থেমে যাওয়ার কোনো দরকার নেই।  ওয়েবের যাত্রা তো কেবল শুরু হয়েছে, আর এই যাত্রায় আপনি একটা মাত্র মাইলস্টোন কমপ্লিট করেছেন। যদি ফ্যামিলিগত কোনো সমস্যা না থাকে তাহলে কোনো ভাবেই এখন উপার্জনের চিন্তা করবেন না। উপার্জনের চিন্তা না করে জ্ঞান অর্জনের চিন্তা করবেন।" 
        },
        {
            "name": "Second Quarter - Be A Designer",
            "sprint": "6",
            "duration": "3 months",
            "summary": "ওয়েব ডিজাইনে দক্ষতা অর্জনের পরবর্তী লক্ষ্য হচ্ছে ওয়েব ডেভেলপমেন্ট। ডেভেলপমেন্টের জন্য আপনাকে একটা প্রোগ্রামিং ল্যাংগুয়েজ শিখতে হবে। ফুলস্ট্যাক ওয়েব ডেভেলপমেন্টের জন্য বর্তমানে বেস্ট প্রোগ্রামিং ল্যাংগুয়েজ হচ্ছে জাভাস্ক্রিপ্ট। আর জাভাস্ক্রিপ্ট শেখা একটু সময় সাধ্য ব্যাপার। তবে এখানে আমরা একটু ট্রিক্স খাটাতে পারি, একবারে সব কনসেপ্ট না বুঝে ধীরে ধীরে অল্প অল্প করে কাজ করার সময় নতুন নতুন টপিক্স শিখে নিতে পারি। এই ভাবে শেখাটাও খুব সহজ কাজ না, তবে চেষ্টা করলে সবই সম্ভব। প্রথমেই আপনাকে জেনে নিতে হবে যে জাভাস্ক্রিপ্টের কোন কোন বিষয় শিখতে হবে, কোন বিষয়টা ঠিক কি কাজে লাগে এবং কখন শেখাটা বুদ্ধিমানের কাজ হবে। তার পরে নিজের মত করে শিখে নেওয়া যেতে পারে।",
            "sprints": [
                {
                    "count": 11,
                    "name": "Programming Fundamentals",
                    "duration": "15 Days",
                    "contents": {
                        "text": "এই পনের দিন আপনি শুধুমাত্র প্রোগ্রামিং এর ফান্ডামেন্টাল বিষয় গুলো শিখবেন জাভাস্ক্রিপ্ট ব্যবহার করে। এডভান্সড কোনো কনসেপ্ট বোঝার দরকার নেই। কন্ডিশন, লুপ, ফাংশন, অ্যারে এবং অবজেক্ট এর মত বিষয় গুলো শিখে ফেলতে হবে। প্রচুর পরিমাণে কোড লিখতে হবে।",
                        "keyPoints": []
                    }
                },
                {
                    "count": 12,
                    "name": "Problem Solving With JS",
                    "duration": "15 Days",
                    "contents": {
                        "text": "প্রোগ্রামিং ফান্ডামেন্টাল সম্পর্কে মোটামুটি একটা ধারণা নেওয়ার পরে পনের দিনের একটা স্প্রিন্ট শুরু করবেন। এবার আপনার কাজ হচ্ছে জাভাস্ক্রিপ্ট দিয়ে সহজ সহজ কিছু সমস্যা সমাধান করার মাধ্যমে জাভাস্ক্রিপ্টের সিনট্যাক্স এর সাথে পরিচিত হয়ে যাওয়া। স্পেসিফিক জাভাস্ক্রিপ্টের জন্যই কিছু অনালাইন জাজ আছে। প্রতিদিন সেখানে গড়ে ১০ টা করে প্রব্লেম সল্ভ করবেন। তাহলে স্প্রিন্ট শেষ হতে হতে ১৫০ টারও বেশি প্রব্লেম সল্ভ হয়ে যাবে। ১৫০ টা মত প্রব্লেম সল্ভ করলে জাভাস্ক্রিপ্টের কোডের সাথে আপনি পুরোপুরি পরিচিত হয়ে যাবেন। তখন আর কোড লিখতে বা অন্যের কোড দেখতে বিরক্ত লাগবে না।",
                        "keyPoints": []
                    }
                },
                {
                    "count": 13,
                    "name": "DOM Manipulation",
                    "duration": "15 Days",
                    "contents": {
                        "text": "পরবর্তী পনের দিনের স্প্রিন্টে আপনি DOM Manipulation শিখবেন। প্রথম পাঁচ দিন ডমের বিভিন্ন ফাংশন, প্রোপার্টিস সম্পর্কে জানবেন। তারপর টানা দশ দিন দশটা ডম রিলেটেড প্রজেক্ট করে ফেলবেন। এই ক্ষেত্রে জাভাস্ক্রিপ্ট ব্যবহার করে এলিমেন্ট ক্রিয়েট করা, অ্যাট্রিবিউট পরিবর্তন করা, ইভেন্ট হ্যান্ডেল করার মত বিষয় গুলো শিখে ফেলবেন।",
                        "keyPoints": []
                    }
                },
                {
                    "count": 14,
                    "name": "New Version of JavaScript",
                    "duration": "15 Days",
                    "contents": {
                        "text": "চৌদ্দ নাম্বার স্প্রিন্টে আপনি জাভাস্ক্রিপ্টের ES6 ভার্সনটা শিখবেন। ES5 এর পর থেকে নতুন নতুন অনেক ফিচার এসেছে, সেগুলো ও একটু শেখার চেষ্টা করবেন। তারপরে ES6 কিভাবে অবজেক্ট অরিয়েন্টেড প্রোগ্রামিং করতে হয় সেটা শিখে ফেলবেন। খুব বেশি গভীরে এখনই শেখা লাগবে না। প্রতিটা বিষয় কিছুটা বুঝতে পারলে এবং নিজে কোড লিখতে পারলেই চলবে। DOM Manipulation শেখার সময় যে প্রোজেক্ট গুলো করেছিলেন, সেগুলোই এখন ES6 এবং অবজেক্ট অরিয়েন্টেড প্রোগ্রামিং ব্যবহার করে প্রাকটিস করবেন।",
                        "keyPoints": []
                    }
                },
                {
                    "count": 15,
                    "name": "Javascript Functions",
                    "duration": "15 Days",
                    "contents": {
                        "text": "আমরা জানি জাভাস্ক্রিপ্ট একটি ফাংশনাল প্রোগ্রামিং ল্যাংগুয়েজ। কিন্তু একজন বিগিনার হিসেবে শুরুতেই আপনার ফাংশনাল প্রোগ্রামিং এর সব কনসেপ্ট বোঝার দরকার নেই। এই স্প্রিন্টে আপনি ফাংশনাল প্রোগ্রামিং এর বেসিক কনসেপ্ট বোঝার চেষ্টা করবেন। অল্প একটু হাইয়ার অর্ডার ফাংশন এবং ফাংশন স্কোপ বুঝতে বুঝতেই এই স্প্রিন্ট শেষ করে ফেলবেন।",
                        "keyPoints": []
                    }
                },
                {
                    "count": 16,
                    "name": "AJAX",
                    "duration": "15 Days",
                    "contents": {
                        "text": "এই কোয়ার্টারের সব শেষে আপনি একটা ডম প্রোজেক্ট করবেন। প্রোজেক্ট সাইজ একটু বড় হবে। এত দিন যা যা শিখলেন তার সব কিছুই এখানে অ্যাপ্লাই করতে হবে। এর সাথ সাথে অল্প দুই একটা বিষয় নতুন করে জানতে হবে। যেমন অ্যাসিংক্রোনাস প্রোগ্রামিং এবং AJAX সম্পর্কে অল্প একটু জ্ঞান নিয়ে API দিয়ে একটা DOM প্রোজেক্ট তৈরি করে ফেলবেন। ব্যস, হয়ে গেলো।",
                        "keyPoints": []
                    }
                }    
            ],
            "congratulation": "জাভাস্ক্রিপ্ট ল্যাংগুয়েজ ব্যবহার করে কাজ করার মত দক্ষতা এখন আপনার হয়েছে। জাভাস্ক্রিপ্ট ছোট ল্যাংগুয়েজ হলেও এর লার্নিং কার্ভটা একটু বড়। সব থেকে সমস্যার বিষয় হচ্ছে, এই ল্যাংগুয়েজের প্রতিটা অংশ যদি ডিপলি বুঝতে যান আপনাকে সময় ব্যয় করতে হবে। আপনি প্রতিটা বিষয়ই শিখবেন, শিখতে হবেই। তবে কিছু দিন কাজ করে অভিজ্ঞতা অর্জনের পরে যখন যেই বিষয়টা জানা লাগবে জেনে নিবেন। জাভাস্ক্রিপ্ট পর্যন্ত মোটামুটি শেষ করার পরে আপনি ওয়েব ডিজাইনের কাজটাই আরও ভালো ভাবে করতে পারবেন। এখানে এচিভমেন্ট বলতে আপনি ওয়েব ডেভেলপমেন্টে জাম্প করার জন্য প্রস্তুত হয়েছেন। এখন আপনি চাইলে ভালো ভাবে ওয়েব ডিজাইনের কাজটাই চালিয়ে যেতে পারেন আরও বেশি কনফিডেন্সের সাথে। তবে আমি বলবো পরবর্তী কোয়ার্টার আপনার জন্য অপেক্ষা করছে, দেরী করা ঠিক হবে না।"
        },
        {
            "name": "Third Quarter - Be A Designer",
            "sprint": "7",
            "duration": "3 months",
            "summary": "বিগত ছয় মাসে আপনার প্রচুর পরিমাণ জ্ঞান অর্জন হয়েছে। এবার সময় এসেছে এই জ্ঞানকে আরও এক ধাপ ওপরে নিয়ে যাওয়ার। থার্ড কোয়ার্টারে আপনি নোডজেএস এবং এক্সপ্রেসজেএস ব্যবহার করে কিভাবে ডাইনামিক ব্যাকেন্ড অ্যাপলিকেশন তৈরি করতে হয় তা শিখবেন। আপনার এখন জাভাস্ক্রিপ্টের মোটামুটি একটা জ্ঞান রয়েছে। ব্যাকেন্ড ডেভেলপমেন্ট শেখার সময় আপনি জাভাস্ক্রিপ্টের অনেক জায়গায় আবার আটকে যেতে পারেন। যখন যেখানে আটকে যাবেন তখন সেই বিষয়টা আবার শিখে নেওয়ার চেষ্টা করবেন। জাভাস্ক্রিপ্টের একটা মোটামুটি জ্ঞান থাকলে ব্যাকেন্ড ডেভেলপমেন্ট আপনার কাছে খুব বেশি কঠিন মনে হবে না। পরবর্তী তিন মাস আপনি শুধু ব্যাকেন্ড ডেভেলপমেন্ট নিয়েই স্টাডি করবেন। তবে প্রথমে যে ওয়েব ডিজাইন শিখলেন, তারপরে যে জাভাস্ক্রিপ্ট শিখলেন পুরো জ্ঞানটাই ব্যাকেন্ড ডেভেলপমেন্টে এখন কাজে লাগবে।",
            "sprints": [
                {
                    "count": 17,
                    "name": "Web Development Big Pictures",
                    "duration": "7 Days",
                    "contents": {
                        "text": "ব্যাকেন্ড ডেভেলপমেন্টের শুরুতেই আপনাকে এর প্রোসেস সম্পর্কে জানতে হবে। একটা ওয়েব অ্যাপলিকেশন কিভাবে কাজ করে, আপনার কি কি দায়িত্ব - এই বিষয় গুলো সব বোঝার চেষ্টা করতে হবে। এই সময় অনেক নতুন নতুন টার্মস চোখের সামনে আসবে। গুগলে সার্চ করে প্রতিটা টার্মসের অর্থ খুঁজে বের করতে হবে, কোনটা কি করে সেগুলো জানতে হবে। সব কিছু শিখে সাত দিনেই বস হয়ে যেতে হবে আমি সেটা বলছি না। আমি বলতে চাচ্ছি সব কিছুর কাজ আপনাকে বুঝতে হবে। যেন পরে সময় মত শিখে নিতে পারেন।",
                        "keyPoints": []
                    }
                },
                {
                    "count": 18,
                    "name": "Explore Express",
                    "duration": "15 Days",
                    "contents": {
                        "text": "আঠারো নাম্বার স্প্রিন্ট অনেক গুরুত্বপূর্ণ স্প্রিন্ট। এই স্প্রিন্টে আপনি শিখবেন কিভাবে এক্সপ্রেস ফ্রেমওয়ার্ক ব্যবহার করে একটা ওয়েবসাইট বানানো যায়। টেম্পলেট ইঞ্জিন কিভাবে কাজ করে, রাউটিং, মিডিলওয়্যার, কন্ট্রোলার, রিকুয়েস্ট-রেসপন্স অবজেক্ট কিভাবে কাজ করে এই সব কিছু আপনি এই পনের দিনে শিখবেন। শুধু তাই না, আপনার ডিজাইন করা ওয়েব সাইট গুলো নোডজেএস ব্যবহার করে কমপ্লিট করবেন এবং সেটা হোস্ট করবেন। এই পনের দিন আপনার জন্য গুরুত্বপূর্ণ সময়।",
                        "keyPoints": []
                    }
                },
                {
                    "count": 19,
                    "name": "Play With Mongo",
                    "duration": "7 Days",
                    "contents": {
                        "text": "পরবর্তী সাত দিন আপনি MongoDB ডেটাবেজ নিয়ে পরে থাকবেন। টার্মিনাল ব্যবহার করে ডেটাবেজে CRUD অপারেশন করবেন। Mongoose ব্যবহার করে নোডজেএস অ্যাপলিকেশনের সাথে MongoDB ডেটাবেজ কানেক্ট করবেন। ডেটা ক্রিয়েট করবেন, ফাইন্ড করবেন, বিভিন্ন ভাবে ফিল্টার করবেন, সার্চ করবেন। বেসিক সমস্ত অপারেশন বারবার প্রাকটিস করবেন।",
                        "keyPoints": []
                    }
                },
                {
                    "count": 20,
                    "name": "Create Admin Dashboard",
                    "duration": "15 Days",
                    "contents": {
                        "text": "এই স্প্রিন্টে আপনার টার্গেট হচ্ছে নিজের ব্লগের জন্য একটা এডমিন ড্যাশবোর্ড বানাবেন। পোর্টফলিও এবং ব্লগ মিলিয়ে একটা ওয়েব সাইট তৈরি করবেন। ওয়েবসাইটের ডেটা গুলো কনট্রোল করার জন্য একটা ড্যাশবোর্ড ডিজাইন করে ফেলবেন। এখানে আপনি ওয়েব ডিজাইন থেকে শুরু করে ডেভেলপমেন্ট পর্যন্ত সম্পূর্ণ কাজ নিজে করবেন।",
                        "keyPoints": []
                    }
                },
                {
                    "count": 21,
                    "name": "Eat Some Cookies",
                    "duration": "15 Days",
                    "contents": {
                        "text": "২০ নাম্বার স্প্রিন্ট আপনি পুরোপুরি শেষ করতে পারবেন না। কারণ একটা ড্যাশবোর্ড বানানোর মত সম্পূর্ণ জ্ঞান এখনো আপনার হয় নি। অনেক গুলো বিষয়ে আপনি আটকে যাবেন। এবার আপনি সেশন সম্পর্কে জানবেন, কুকিস সম্পর্কে জানবেন। অথেনটিকেশন টেকনিক সম্পর্কে জানবেন, ফাইল আপলোড, ফর্ম ভ্যালিডেশনের মত বিষয় গুলো সম্পর্কে জানবেন। এই স্প্রিন্ট শেষ হতে হতে আপনার অ্যাপলিকেশন পুরোপুরি তৈরি হয়ে যাবে এবং আমরা আপনার ওয়েবসাইটে ভিসিটও করতে পারবো।",
                        "keyPoints": []
                    }
                },
                {
                    "count": 22,
                    "name": "REST API service",
                    "duration": "15 Days",
                    "contents": {
                        "text": "ব্যাকেন্ড ডেভেলপমেন্টের পাঁচটা স্প্রিন্ট এবং দুই মাস শেষ। পরবর্তী পনের দিন আপনি REST API সম্পর্কে জানবেন। REST API কি, কিভাবে বানাতে হয় সেই বিষয় গুলো জানবেন। কিভাবে REST API সিকিউর করতে হয় সেটা শিখবেন। JWT, OAuth2, ফাইল হ্যান্ডেলিং এর বিষয় বস্তু গুলো শিখে ফেলবেন। সহজ কথায় আপনি রেস্ট এপিআই তৈরি করা শিখে ফেলবেন।",
                        "keyPoints": []
                    }
                },
                {
                    "count": 23,
                    "name": "REST API for ECommerce",
                    "duration": "15 Days",
                    "contents": {
                        "text": "এই কোয়ার্টারের সর্বশেষ স্প্রিন্ট হচ্ছে পনের দিনের স্প্রিন্ট। এই স্প্রিন্টে আপনি স্পেসিফিক ভাবে নতুন কিছু শিখবেন না। আপনার যেই জ্ঞান আছে তা দিয়েই ঝাঁপিয়ে পড়বেন একটা ইকমার্স সাইটের জন্য REST API তৈরির কাজে। এই স্প্রিন্ট এবং কোয়ার্টার শেষ হতে হতে আপনার ব্যাকেন্ড সম্পর্কে খুব ভালো একটা জ্ঞান অর্জন হয়ে যাবে।",
                        "keyPoints": []
                    }
                }     
            ],
            "congratulation": "আপনার একটি নতুন পরিচয় তৈরি হওয়ার জন্য আপনাকে শুভকামনা। এখন আপনি একজন ব্যাকেন্ড ডেভেলপার, একজন ওয়েব ডেভেলপার। ঠিক এই মুহুর্তে আপনার সামনে তিনটা রাস্তা খোলা আছে। আপনি যে কোনো একটি বেছে নিতে পারেন। কিন্তু একই সময়ে দুইটা রাস্তা বেছে নেওয়াটা বোকামি হবে। প্রথম রাস্তাঃ আপনি যেহেতু এখন একটা ওয়েব অ্যাপলিকেশন তৈরি করতে পারেন, REST API তৈরি করতে পারেন তাই খুব সহজেই আপনি মার্কেটপ্লেস এর জন্য নিজেকে তৈরি করতে পারেন, জুনিয়র লেভেল জবের জন্য প্রিপারেশন নিয়ে নিতে পারেন। পরে আস্তে আস্তে ডিপলি শিখবেন। দ্বিতীয় রাস্তাঃ আপনি এখন ওয়েব ডেভেলপার হলেও জুনিয়র লেভেলের একজন ওয়েব ডেভেলপার। ব্যাকেন্ড ডেভেলপমেন্ট সেক্টরটা অনেক বড়। আপনি চাইলে এই সেক্টরের ডিপ নলেজ নিয়ে পড়াশোনা শুরু করতে পারেন। অনেক অনেক বিষয় বস্তু আছে, টেকনোলজি আছে যা একজন ব্যাকেন্ড ডেভেলপারকে জানতে হয়। আপনি সেই অ্যাডভান্সড বিষয় বস্তু নিয়ে এখনই পড়াশোনা শুরু করে দিন। তৃতীয় রাস্তাঃ একটা ভালো ফ্রন্টেন্ড ফ্রেমওয়ার্ক শিখে ফুলস্ট্যাক জার্নিটা কমপ্লিট করুন। ফ্রন্টেন্ড ব্যাকেন্ড দুইটার সাথেই পরিচিত হওয়ার পরে সিদ্ধান্ত নিবেন যে কোন দিকে আবার যাত্রা শুরু করবেন, কোন দিকে বস হওয়ার জন্য শুরু করবেন। আমি অবশ্য তৃতীয় রাস্তাটায় বেছে নেবো এই মুহুর্তে।"
        },
        {
            "name": "Fourth Quarter - Be A Designer",
            "sprint": "7",
            "duration": "3 months",
            "summary": "নন স্টপ দীর্ঘ নয় মাস, তিনটা কোয়ার্টার, তেইশটা স্প্রিন্ট এবং অগণিত টেকনোলজি শেখার পরে আপনি এখন নিজেকে ওয়েব ডেভেলপার বলতে পারেন। কিন্তু আপনার যাত্রা এখনও শেষ হয়নি, আরও একটা কোয়ার্টার আপনার জন্য অপেক্ষা করছে। এই তিন মাসে আপনি React ব্যবহার করে মডার্ন Frontend Application Development শিখবেন, সিঙ্গেল পেজ অ্যাপলিকেশন ডেভেলপমেন্ট শিখবেন। React শেখার ক্ষেত্রে আপনার কাজে লাগবে বিগত তিন কোয়ার্টারে শিখে আসা সব গুলো জ্ঞান। ",
            "sprints": [
                {
                    "count": 24,
                    "name": "Understand Frontend Development",
                    "duration": "7 Days",
                    "contents": {
                        "text": "আপনার প্রথম কাজ হচ্ছে মডার্ন ফ্রন্টেন্ড ডেভেলপমেন্ট সম্পর্কে জ্ঞান অর্জন করা। ফ্রন্টেন্ড অ্যাপলিকেশন কি, কিভাবে কাজ করে, ডেভেলপ করতে কি কি টুলস লাগে, টুলস গুলো কেন লাগে, কি কি শিখতে হয় এর সব কিছু সাত দিনে খুঁজে মাথার মধ্যে ঢুকিয়ে নিতে হবে। প্রচুর নতুন নাম আসবে, সেগুলোর অর্থ জানতে হবে এবং কি কাজ করে সেগুলো বুঝতে হবে। আর মেন্টালি ফ্রন্টেন্ড ডেভেলপার হওয়ার জন্য প্রিপারেশন নিতে হবে।",
                        "keyPoints": []
                    }
                },
                {
                    "count": 25,
                    "name": "Understand Components",
                    "duration": "15 Days",
                    "contents": {
                        "text": "এই স্প্রিন্টে আপনার পরিচয় হবে React এর সাথে। আগামী পনের দিন আপনি React এর কোর কসেপ্ট গুলো ভালো মতো বোঝার চেষ্টা করবেন। যেমন - Component, Component Tree, JSX, Props, State, Event Handling, Conditional Rendering এর মত বিষয় গুলো সব শিখে ফেলবেন। শেখার সাথে সাথে ছোট ছোট কিছু অ্যাপলিকেশন বানাবেন, তাহলে শেখাটা আরও অনেক বেশি ইফেক্টিভ হবে। ",
                        "keyPoints": []
                    }
                },
                {
                    "count": 26,
                    "name": "React Hooks",
                    "duration": "7 Days",
                    "contents": {
                        "text": "এই সাত দিনের ছোট্ট স্প্রিন্টে আপনার কাজ হচ্ছে React এর Hooks সম্পর্কে জ্ঞান অর্জন করা। Hooks কি, কেন, কিভাবে, বিল্ট কি কি হুকস আছে, কি ভাবে কাস্টম হুকস তৈরি করা যায় এই সব কিছু শিখে ফেলতে হবে। এক বারে ডিপে গিয়ে তো এত কিছু এত দ্রুত শেখা যাবে না। তাই সব গুলো হুকের ব্যবহার ভাল ভাবে বোঝার চেষ্টা করতে হবে। থার্ড পার্টি কিছু হুক আছে, সেগুলো কিভাবে ইন্সটল করে ব্যবহার করতে হয় সেই বিষয় গুলোও শিখে নিতে হবে।",
                        "keyPoints": []
                    }
                },
                {
                    "count": 27,
                    "name": "State Management",
                    "duration": "15 Days",
                    "contents": {
                        "text": "পরবর্তী পনের দিন আপনার কাজ শুধু মাত্র ষ্টেট নিয়ে চিন্তা করা। ষ্টেট কি, কেন আর কিভাবে? এই প্রশ্ন গুলোর উত্তর খুঁজতে হবে। Redux নিয়ে অল্প স্বল্প পড়াশোনা করে বোঝার চেষ্টা করতে হবে। না বোঝা গেলেও এখন সমস্যা নেই, প্রথমে Easy Peasy এর মতো Redux Wrapper ব্যবহার করে কাজ করতে পারেন। পরে সময়ের সাথে সাথে নিজে নিজেই Redux বুঝে যাবেন। Redux and Easy Peasy ব্যবহার করে দুই একটা ছোট খাটো অ্যাপলিকেশনের ষ্টেট ম্যানেজ করবেন।",
                        "keyPoints": []
                    }
                },
                {
                    "count": 28,
                    "name": "Frontend Routing Technique",
                    "duration": "7 Days",
                    "contents": {
                        "text": "এই সাত দিনে আপনার কাজ হচ্ছে ফ্রন্টেন্ড অ্যাপলিকেশনে কিভাবে রাউটিং করা যায়, বিশেষ করে React অ্যাপলিকেশনের কিভাবে রাউটিং করা যায়, রাউটিং এর সাথে কি কি ফিচার আছে, কিভাবে রাউট প্রোটেক্ট করা যায় এই সব কিছু শিখে ফেলতে হবে। তারপরে চট করে দুই তিনটা প্রোজেক্টের লেআউট তৈরি করে ফেলতে হবে।",
                        "keyPoints": []
                    }
                },
                {
                    "count": 29,
                    "name": "Style Your Application",
                    "duration": "7 Days",
                    "contents": {
                        "text": "ফাইনাল একটা বড় সড় প্রোজেক্ট করার আগে React অ্যাপলিকেশন কিভাবে স্টাইল করবেন সেটা শিখে নেওয়া যেতে পারে। যেহেতু আমাদের হাতে সময় অল্প তাই আমরা কোনো দিকে না তাকিয়ে সরাসরি Material UI শিখে ফেলতে পারি। আগামী সাত দিন মনের মতো Material UI নিয়ে খেলা করবেন। কয়েকটা ভিন্ন ভিন্ন পেজ বানাবেন। বিভিন্ন কম্পোনেন্ট ব্যবহার করে কিছু সুন্দর অ্যাপলিকেশন বানানোর চেষ্টা করবেন।",
                        "keyPoints": []
                    }
                },
                {
                    "count": 30,
                    "name": "It's Your Time",
                    "duration": "30 Days",
                    "contents": {
                        "text": "ওয়েব ডেভেলপমেন্টের এই বৃহৎ জার্নির সর্বশেষ এবং সর্ববৃহৎ স্প্রিন্ট এটাই। এখানে সব কিছুই আপনার হাতে। আপনি বিগত এগারো মাস ধরে অনেক কিছু শিখেছেন, অনেক টুলস ব্যবহার করেছেন এখন এই এক মাস আপনার সর্বশেষ চ্যালেঞ্জের মাস। যদি এই শেষ মাসটা আপনি নিজেকে চ্যালেঞ্জের মুখে দাঁড় করাতে পারেন তাহলে টেকনোলজি জগতে টিকে থাকার গ্রিন কার্ড আপনি পেয়ে যাবেন। আপনি ব্যাকেন্ড শেখার পরে ইকমার্সের যেই এপিআই তৈরি করেছিলেন সেই এপিআই ব্যবহার করে একটা কমপ্লিট অ্যাপলিকেশন তৈরি করতে হবে এই স্প্রিন্টে।",
                        "keyPoints": []
                    }
                }     
            ],
            "congratulation": "Done, You Have Done. There is Nothing to Do. Go and Suicide"
        }
    ]
}